HELYXcore-4.4.0/modules/swak4Foam/Examples/groovyBC/movingConeDistorted/constant/dynamicMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.5                                   |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      dynamicMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

mover
{
    type            motionSolver;
    libs            ( "libfvMeshMovers.so" "libfvMotionSolvers.so" );
    motionSolver    velocityLaplacian;
    // motionSolver velocityComponentLaplacian x;

    diffusivity  uniform;
    // diffusivity  directional (1 200 0);
    // diffusivity  motionDirectional (1 1000 0);
    // diffusivity  inverseDistance 1(movingWall);
    // diffusivity  file motionDiffusivity;
    // diffusivity  quadratic inverseDistance 1(movingWall);
    // diffusivity  exponential 2000 inverseDistance 1(movingWall);

    velocityLaplacianCoeffs
    {
        diffusivity  uniform;
    }
}


// ************************************************************************* //
