HELYXcore-4.4.0/modules/swak4Foam/Examples/groovyBC/movingConeDistorted/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1712                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

8
(
    movingWall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          85;
        startFace       3665;
    }
    farFieldMoving
    {
        type            patch;
        nFaces          50;
        startFace       3750;
    }
    fixedWall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          35;
        startFace       3800;
    }
    axis
    {
        type            symmetryPlane;
        inGroups        1(symmetryPlane);
        nFaces          0;
        startFace       3835;
    }
    left
    {
        type            patch;
        nFaces          30;
        startFace       3835;
    }
    farField
    {
        type            patch;
        nFaces          35;
        startFace       3865;
    }
    back
    {
        type            wedge;
        inGroups        1(wedge);
        nFaces          1900;
        startFace       3900;
    }
    front
    {
        type            wedge;
        inGroups        1(wedge);
        nFaces          1900;
        startFace       5800;
    }
)

// ************************************************************************* //
