HELYXcore-4.4.0/modules/swak4Foam/Examples/groovyBC/movingConeDistorted/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.5                                   |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    pcorr
    {
        solver PCG;
        preconditioner   DIC;
        tolerance        1e-02;
        relTol           0;
    };

    p
    {
        solver PCG;
        preconditioner   DIC;
        tolerance        1e-06;
        relTol           0.05;
    };

    pFinal
    {
        solver PCG;
        preconditioner   DIC;
        tolerance        1e-06;
        relTol           0;
    };

    U
    {
        solver PBiCG;
        preconditioner   DILU;
        tolerance        1e-05;
        relTol           0;
    };

    UFinal
    {
        $U;
        tolerance       1e-05;
        relTol          0;
    }

    cellMotionUx
    {
        solver PCG;
        preconditioner   DIC;
        tolerance        1e-08;
        relTol           0;
    };
    cellMotionU {
        $cellMotionUx;
    }
}

PIMPLE
{
    nOuterCorrectors    2;
    nCorrectors     2;
    nNonOrthogonalCorrectors 2;
}

// ************************************************************************* //
